interface Location {
  id: number;
  name: string;
}

export const locations: Location[] = [
  {
    id: 6,
    name: '土杉',
  },
  {
    id: 62,
    name: '欒樹 701',
  },
  {
    id: 63,
    name: '欒樹 702',
  },
  {
    id: 64,
    name: '欒樹 703',
  },
  {
    id: 65,
    name: '欒樹 704',
  },
  {
    id: 70,
    name: '南洋杉 A',
  },
  {
    id: 71,
    name: '南洋杉 B',
  },
  {
    id: 72,
    name: '南洋杉 C',
  },
  {
    id: 73,
    name: '南洋杉 E',
  },
  {
    id: 74,
    name: '南洋杉 D',
  },
  {
    id: 110,
    name: '四季春 401',
  },
  {
    id: 111,
    name: '四季春 402',
  },
  {
    id: 112,
    name: '四季春 403',
  },
  {
    id: 113,
    name: '四季春 404',
  },
  {
    id: 114,
    name: '四季春 405',
  },
  {
    id: 115,
    name: '四季春 406',
  },
  {
    id: 116,
    name: '四季春 407',
  },
  {
    id: 117,
    name: '四季春 408',
  },
  {
    id: 118,
    name: '四季春 409',
  },
  {
    id: 119,
    name: '四季春 410',
  },
  {
    id: 121,
    name: '白梅 A',
  },
  {
    id: 122,
    name: '白梅 B',
  },
  {
    id: 123,
    name: '白梅 C',
  },
  {
    id: 124,
    name: '白梅 D',
  },
  {
    id: 125,
    name: '白梅 E',
  },
  {
    id: 126,
    name: '胡桃 A',
  },
  {
    id: 127,
    name: '胡桃 B',
  },
  {
    id: 128,
    name: '胡桃 C',
  },
  {
    id: 129,
    name: '胡桃 D',
  },
  {
    id: 130,
    name: '胡桃 E',
  },
  {
    id: 131,
    name: '澤米芋 801',
  },
  {
    id: 132,
    name: '澤米芋 802',
  },
  {
    id: 133,
    name: '澤米芋 803',
  },
  {
    id: 134,
    name: '澤米芋 804',
  },
  {
    id: 135,
    name: '澤米芋 805',
  },
  {
    id: 136,
    name: '馬告 601',
  },
  {
    id: 137,
    name: '馬告 602',
  },
  {
    id: 138,
    name: '馬告 603',
  },
  {
    id: 139,
    name: '馬告 604',
  },
  {
    id: 149,
    name: '香杉 201',
  },
  {
    id: 150,
    name: '香杉 202',
  },
  {
    id: 151,
    name: '香杉 203',
  },
  {
    id: 152,
    name: '香杉 204',
  },
  {
    id: 153,
    name: '香杉 301',
  },
  {
    id: 154,
    name: '香杉 302',
  },
  {
    id: 155,
    name: '香杉 303',
  },
  {
    id: 156,
    name: '香杉 304',
  },
  {
    id: 157,
    name: '香杉 401',
  },
  {
    id: 158,
    name: '香杉 402',
  },
  {
    id: 159,
    name: '香杉 403',
  },
  {
    id: 160,
    name: '香杉 404',
  },
  {
    id: 161,
    name: '香杉 405',
  },
  {
    id: 162,
    name: '香杉 501',
  },
  {
    id: 163,
    name: '檸檬 A',
  },
  {
    id: 164,
    name: '檸檬 B',
  },
  {
    id: 165,
    name: '檸檬 C',
  },
  {
    id: 168,
    name: '流蘇 201',
  },
  {
    id: 169,
    name: '流蘇 202',
  },
  {
    id: 170,
    name: '流蘇 203',
  },
  {
    id: 172,
    name: '天日松 12A',
  },
  {
    id: 173,
    name: '天日松 12B',
  },
  {
    id: 175,
    name: '天日松 12D',
  },
  {
    id: 176,
    name: '天日松 12E',
  },
  {
    id: 177,
    name: '天日松 12F',
  },
  {
    id: 179,
    name: '澤米芋 901',
  },
  {
    id: 180,
    name: '澤米芋 902',
  },
  {
    id: 181,
    name: '澤米芋 903',
  },
  {
    id: 185,
    name: '禾雀 601',
  },
  {
    id: 186,
    name: '禾雀 602',
  },
  {
    id: 187,
    name: '禾雀 603',
  },
  {
    id: 188,
    name: '月月紅 801',
  },
  {
    id: 189,
    name: '月月紅 802',
  },
  {
    id: 190,
    name: '月月紅 803',
  },
  {
    id: 191,
    name: '月月紅 804',
  },
  {
    id: 248,
    name: '烏來柯 601',
  },
  {
    id: 249,
    name: '烏來柯 602',
  },
  {
    id: 250,
    name: '烏來柯 603',
  },
  {
    id: 251,
    name: '烏來柯 604',
  },
  {
    id: 252,
    name: '烏來柯 605',
  },
  {
    id: 267,
    name: '巒大杉 101',
  },
  {
    id: 268,
    name: '巒大杉 201',
  },
  {
    id: 269,
    name: '巒大杉 202',
  },
  {
    id: 270,
    name: '巒大杉 203',
  },
  {
    id: 271,
    name: '巒大杉 301',
  },
  {
    id: 272,
    name: '巒大杉 302',
  },
  {
    id: 273,
    name: '巒大杉 303',
  },
  {
    id: 274,
    name: '巒大杉 304',
  },
  {
    id: 275,
    name: '巒大杉 305',
  },
  {
    id: 277,
    name: '巒大杉 401',
  },
  {
    id: 280,
    name: '蒲公英 901',
  },
  {
    id: 281,
    name: '蒲公英 902',
  },
  {
    id: 282,
    name: '蒲公英 903',
  },
  {
    id: 283,
    name: '蒲公英 904',
  },
  {
    id: 284,
    name: '蒲公英 905',
  },
  {
    id: 285,
    name: '蒲公英 906',
  },
  {
    id: 286,
    name: '蒲公英 907',
  },
  {
    id: 287,
    name: '蒲公英 908',
  },
  {
    id: 288,
    name: '蒲公英 909',
  },
  {
    id: 289,
    name: '蒲公英 910',
  },
  {
    id: 290,
    name: '蒲公英 911',
  },
  {
    id: 291,
    name: '蒲公英 912',
  },
  {
    id: 292,
    name: '蒲公英 913',
  },
  {
    id: 293,
    name: '蒲公英 914',
  },
  {
    id: 294,
    name: '蒲公英 915',
  },
  {
    id: 295,
    name: '蒲公英 916',
  },
  {
    id: 296,
    name: '蒲公英 917',
  },
  {
    id: 297,
    name: '蒲公英 918',
  },
  {
    id: 298,
    name: '蒲公英 919',
  },
  {
    id: 303,
    name: '桂竹 201',
  },
  {
    id: 304,
    name: '桂竹 202',
  },
  {
    id: 305,
    name: '桂竹 203',
  },
  {
    id: 306,
    name: '桂竹 301',
  },
  {
    id: 307,
    name: '桂竹 302',
  },
  {
    id: 308,
    name: '桂竹 303',
  },
  {
    id: 309,
    name: '桂竹 304',
  },
  {
    id: 310,
    name: '木棉 201',
  },
  {
    id: 311,
    name: '木棉 202',
  },
  {
    id: 312,
    name: '木棉 203',
  },
  {
    id: 313,
    name: '木棉 204',
  },
  {
    id: 314,
    name: '木棉 205',
  },
  {
    id: 315,
    name: '木棉 206',
  },
  {
    id: 316,
    name: '木棉 207',
  },
  {
    id: 317,
    name: '木棉 208',
  },
  {
    id: 318,
    name: '木棉 209',
  },
  {
    id: 319,
    name: '木棉 210',
  },
  {
    id: 320,
    name: '木棉 211',
  },
  {
    id: 323,
    name: '蒲葵 1301',
  },
  {
    id: 324,
    name: '月橘 1301',
  },
  {
    id: 325,
    name: '月橘 1302',
  },
  {
    id: 326,
    name: '月橘 1303',
  },
  {
    id: 327,
    name: '月橘 1304',
  },
  {
    id: 328,
    name: '月橘 1305',
  },
  {
    id: 329,
    name: '月橘 1306',
  },
  {
    id: 330,
    name: '月橘 1307',
  },
  {
    id: 331,
    name: '月橘 1308',
  },
  {
    id: 332,
    name: '桂花 1101',
  },
  {
    id: 333,
    name: '桂花 1102',
  },
  {
    id: 334,
    name: '香楠 701',
  },
  {
    id: 335,
    name: '香楠 702',
  },
  {
    id: 336,
    name: '香楠 703',
  },
  {
    id: 337,
    name: '香楠 704',
  },
  {
    id: 338,
    name: '香楠 705',
  },
  {
    id: 342,
    name: '香楠 709',
  },
  {
    id: 343,
    name: '香楠 710',
  },
  {
    id: 344,
    name: '香楠 711',
  },
  {
    id: 345,
    name: '香楠 712',
  },
  {
    id: 346,
    name: '香楠 713',
  },
  {
    id: 347,
    name: '香楠 714',
  },
  {
    id: 349,
    name: '赤楊 201',
  },
  {
    id: 350,
    name: '赤楊 202',
  },
  {
    id: 351,
    name: '赤楊 203',
  },
  {
    id: 352,
    name: '赤楊 204',
  },
  {
    id: 353,
    name: '赤楊 205',
  },
  {
    id: 354,
    name: '赤楊 301',
  },
  {
    id: 355,
    name: '赤楊 302',
  },
  {
    id: 356,
    name: '赤楊 303',
  },
  {
    id: 357,
    name: '赤楊 304',
  },
  {
    id: 358,
    name: '赤楊 305',
  },
  {
    id: 359,
    name: '赤楊 306',
  },
  {
    id: 360,
    name: '榕樹 201',
  },
  {
    id: 362,
    name: '紅豆杉 201',
  },
  {
    id: 363,
    name: '紅豆杉 202',
  },
  {
    id: 364,
    name: '紅豆杉 203',
  },
  {
    id: 365,
    name: '紅豆杉 204',
  },
  {
    id: 366,
    name: '紅豆杉 301',
  },
  {
    id: 367,
    name: '紅豆杉 302',
  },
  {
    id: 368,
    name: '紅豆杉 303',
  },
  {
    id: 369,
    name: '紅豆杉 304',
  },
  {
    id: 370,
    name: '紅豆杉 401',
  },
  {
    id: 371,
    name: '紅豆杉 402',
  },
  {
    id: 372,
    name: '紅豆杉 403',
  },
  {
    id: 373,
    name: '紅豆杉 404',
  },
  {
    id: 375,
    name: '楓香 401',
  },
  {
    id: 376,
    name: '楓香 402',
  },
  {
    id: 377,
    name: '楓香 403',
  },
  {
    id: 378,
    name: '楓香 404',
  },
  {
    id: 379,
    name: '楓香 405',
  },
  {
    id: 380,
    name: '楓香 406',
  },
  {
    id: 381,
    name: '楓香 407',
  },
  {
    id: 382,
    name: '楓香 408',
  },
  {
    id: 383,
    name: '楓香 409',
  },
  {
    id: 384,
    name: '楓香 410',
  },
  {
    id: 385,
    name: '楓香 411',
  },
  {
    id: 386,
    name: '楓香 412',
  },
  {
    id: 387,
    name: '楓香 413',
  },
  {
    id: 388,
    name: '楓香 414',
  },
  {
    id: 389,
    name: '楓香 415',
  },
  {
    id: 390,
    name: '楓香 416',
  },
  {
    id: 395,
    name: '大葉桉 201',
  },
  {
    id: 396,
    name: '大葉桉 202',
  },
  {
    id: 397,
    name: '大葉桉 203',
  },
  {
    id: 398,
    name: '大葉桉 204',
  },
  {
    id: 399,
    name: '大葉桉 205',
  },
  {
    id: 400,
    name: '大葉桉 206',
  },
  {
    id: 401,
    name: '大葉桉 207',
  },
  {
    id: 402,
    name: '大葉桉 208',
  },
  {
    id: 403,
    name: '大葉桉 209',
  },
  {
    id: 404,
    name: '大葉桉 210',
  },
  {
    id: 405,
    name: '大葉桉 211',
  },
  {
    id: 406,
    name: '大葉桉 212',
  },
  {
    id: 407,
    name: '大葉桉 213',
  },
  {
    id: 408,
    name: '大葉桉 214',
  },
  {
    id: 409,
    name: '大葉桉 215',
  },
  {
    id: 410,
    name: '大葉桉 216',
  },
  {
    id: 411,
    name: '大葉桉 217',
  },
  {
    id: 412,
    name: '大葉桉 218',
  },
  {
    id: 413,
    name: '大葉桉 219',
  },
  {
    id: 414,
    name: '大葉桉 220',
  },
  {
    id: 417,
    name: '木豆 01',
  },
  {
    id: 418,
    name: '木豆 02',
  },
  {
    id: 419,
    name: '木豆 03',
  },
  {
    id: 428,
    name: '椰子樹 101',
  },
  {
    id: 429,
    name: '椰子樹 102',
  },
  {
    id: 430,
    name: '椰子樹 103',
  },
  {
    id: 431,
    name: '椰子樹 104',
  },
  {
    id: 432,
    name: '椰子樹 105',
  },
  {
    id: 433,
    name: '椰子樹 201',
  },
  {
    id: 434,
    name: '椰子樹 202',
  },
  {
    id: 435,
    name: '椰子樹 203',
  },
  {
    id: 436,
    name: '椰子樹 204',
  },
  {
    id: 439,
    name: '杉松 101',
  },
  {
    id: 440,
    name: '杉松 301',
  },
  {
    id: 441,
    name: '杉松 302',
  },
  {
    id: 442,
    name: '杉松 303',
  },
  {
    id: 443,
    name: '杉松 304',
  },
  {
    id: 444,
    name: '杉松 305',
  },
  {
    id: 445,
    name: '杉松 306',
  },
  {
    id: 447,
    name: '四季豆 01',
  },
  {
    id: 448,
    name: '四季豆 02',
  },
  {
    id: 449,
    name: '四季豆 03',
  },
  {
    id: 450,
    name: '山菜豆 01',
  },
  {
    id: 451,
    name: '山菜豆 02',
  },
  {
    id: 452,
    name: '山菜豆 03',
  },
  {
    id: 453,
    name: '桂花 1103',
  },
  {
    id: 454,
    name: '桂花 1104',
  },
  {
    id: 461,
    name: '赤楊 206',
  },
  {
    id: 462,
    name: '赤楊 207',
  },
  {
    id: 463,
    name: '赤楊 208',
  },
  {
    id: 464,
    name: '花生 101',
  },
  {
    id: 465,
    name: '四人電話亭 甘豆',
  },
  {
    id: 466,
    name: '豆角 01',
  },
  {
    id: 467,
    name: '豆角 02',
  },
  {
    id: 468,
    name: '心豆 01',
  },
  {
    id: 469,
    name: '心豆 02',
  },
  {
    id: 470,
    name: '棕櫚 201',
  },
  {
    id: 471,
    name: '棕櫚 202',
  },
  {
    id: 472,
    name: '棕櫚 203',
  },
  {
    id: 473,
    name: '棕櫚 204',
  },
  {
    id: 474,
    name: '棕櫚 205',
  },
  {
    id: 475,
    name: '棕櫚 206',
  },
  {
    id: 476,
    name: '棕櫚 207',
  },
  {
    id: 477,
    name: '棕櫚 208',
  },
  {
    id: 478,
    name: '本來 101',
  },
  {
    id: 479,
    name: '本來 102',
  },
  {
    id: 480,
    name: '本來 103',
  },
  {
    id: 481,
    name: '本來 105',
  },
  {
    id: 482,
    name: '本來 201',
  },
  {
    id: 483,
    name: '本來 202',
  },
  {
    id: 484,
    name: '本來 203',
  },
  {
    id: 485,
    name: '本來 205',
  },
  {
    id: 486,
    name: '本來 206',
  },
  {
    id: 487,
    name: '本來 207',
  },
  {
    id: 488,
    name: '本來 301',
  },
  {
    id: 489,
    name: '本來 302',
  },
  {
    id: 490,
    name: '本來 303',
  },
  {
    id: 491,
    name: '本來 305',
  },
  {
    id: 492,
    name: '本來 306',
  },
  {
    id: 493,
    name: '本來 307',
  },
  {
    id: 495,
    name: '榕樹 202',
  },
  {
    id: 499,
    name: '牡丹 301',
  },
  {
    id: 500,
    name: '牡丹 302',
  },
  {
    id: 501,
    name: '牡丹 303',
  },
  {
    id: 502,
    name: '牡丹 304',
  },
  {
    id: 503,
    name: 'Talk Central 01',
  },
  {
    id: 504,
    name: 'Talk Central 02',
  },
  {
    id: 505,
    name: '花椒 901',
  },
  {
    id: 506,
    name: '花椒 902',
  },
  {
    id: 507,
    name: '花椒 903',
  },
  {
    id: 508,
    name: '花椒 904',
  },
  {
    id: 509,
    name: '花椒 905',
  },
  {
    id: 510,
    name: 'Talk Central 03',
  },
  {
    id: 511,
    name: 'Talk Central 04',
  },
  {
    id: 512,
    name: 'Talk Central 05',
  },
  {
    id: 513,
    name: 'Talk Central 06',
  },
  {
    id: 514,
    name: 'Talk Central 07',
  },
  {
    id: 515,
    name: 'Talk Central 08',
  },
  {
    id: 516,
    name: 'Talk Central 09',
  },
  {
    id: 517,
    name: 'Talk Central 10',
  },
  {
    id: 518,
    name: '敲敲計時工作室 L001',
  },
  {
    id: 519,
    name: '敲敲計時工作室 L002',
  },
  {
    id: 520,
    name: '敲敲計時工作室 L003',
  },
  {
    id: 521,
    name: '敲敲計時工作室 L004',
  },
  {
    id: 522,
    name: '咖啡廳窗景個人位',
  },
  {
    id: 523,
    name: '沙發個人獨立包廂',
  },
  {
    id: 524,
    name: '龍眼 501',
  },
  {
    id: 525,
    name: '龍眼 502',
  },
  {
    id: 526,
    name: '龍眼 503',
  },
  {
    id: 527,
    name: '木荷 301',
  },
  {
    id: 528,
    name: '木荷 302',
  },
  {
    id: 529,
    name: '木荷 303',
  },
  {
    id: 530,
    name: '木荷 304',
  },
  {
    id: 531,
    name: '木荷 305',
  },
  {
    id: 532,
    name: 'MAKER BAY共享空間 01',
  },
  {
    id: 533,
    name: 'MAKER BAY共享空間 02',
  },
  {
    id: 534,
    name: 'MAKER BAY共享空間 03',
  },
  {
    id: 535,
    name: 'MAKER BAY共享空間 04',
  },
  {
    id: 536,
    name: 'MAKER BAY共享空間 05',
  },
  {
    id: 537,
    name: 'MAKER BAY共享空間 06',
  },
  {
    id: 538,
    name: 'MAKER BAY共享空間 07',
  },
  {
    id: 539,
    name: 'MAKER BAY共享空間 08',
  },
  {
    id: 544,
    name: 'MAKER BAY共享空間 09',
  },
  {
    id: 545,
    name: 'MAKER BAY共享空間 10',
  },
  {
    id: 546,
    name: 'MAKER BAY共享空間 11',
  },
  {
    id: 547,
    name: 'MAKER BAY共享空間 12',
  },
  {
    id: 551,
    name: '虹樹 101',
  },
  {
    id: 552,
    name: '虹樹 102',
  },
  {
    id: 553,
    name: '虹樹 103',
  },
  {
    id: 554,
    name: '虹樹 201',
  },
  {
    id: 555,
    name: '虹樹 202',
  },
  {
    id: 556,
    name: '虹樹 301',
  },
  {
    id: 557,
    name: '虹樹 302',
  },
  {
    id: 558,
    name: '穗花杉 101',
  },
  {
    id: 559,
    name: '穗花杉 201',
  },
  {
    id: 560,
    name: '穗花杉 301',
  },
  {
    id: 561,
    name: '穗花杉 401',
  },
  {
    id: 563,
    name: '香楠 706',
  },
  {
    id: 564,
    name: '香楠 707',
  },
  {
    id: 565,
    name: '香楠 708',
  },
  {
    id: 566,
    name: '大明竹 201',
  },
  {
    id: 567,
    name: '合歡 B301',
  },
  {
    id: 568,
    name: '合歡 B302',
  },
  {
    id: 569,
    name: '小方桌咖啡座',
  },
  {
    id: 570,
    name: '方桌個人位',
  },
  {
    id: 571,
    name: '合歡 B303',
  },
  {
    id: 572,
    name: '合歡 B304',
  },
  {
    id: 573,
    name: '合歡 B305',
  },
  {
    id: 574,
    name: '合歡 B306',
  },
  {
    id: 575,
    name: '綠豆 電話亭 1',
  },
  {
    id: 576,
    name: '綠豆 電話亭 2',
  },
  {
    id: 578,
    name: '新莊膠囊 青豆 2',
  },
  {
    id: 579,
    name: '新莊膠囊 青豆 3',
  },
  {
    id: 580,
    name: '新莊膠囊 青豆 4',
  },
  {
    id: 583,
    name: '新莊膠囊 青豆 7',
  },
  {
    id: 585,
    name: '藍桉 301',
  },
  {
    id: 586,
    name: '無患子 B101',
  },
  {
    id: 587,
    name: '美鐵芋 101',
  },
  {
    id: 588,
    name: '常春藤 801',
  },
  {
    id: 589,
    name: '金石榴 106',
  },
  {
    id: 590,
    name: '金石榴 204',
  },
  {
    id: 591,
    name: '杜鵑 301',
  },
  {
    id: 592,
    name: '杜鵑 302',
  },
  {
    id: 593,
    name: '杜鵑 303',
  },
  {
    id: 594,
    name: '杜鵑 304',
  },
  {
    id: 605,
    name: '柳杉 201',
  },
  {
    id: 606,
    name: '柳杉 202',
  },
  {
    id: 607,
    name: '柳杉 203',
  },
  {
    id: 608,
    name: '柳杉 301',
  },
  {
    id: 609,
    name: '柳杉 302',
  },
];
